# ImportOptions3DM Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
ImportOptions3DM Constructor
ImportOptions3DM Class See Also
---
Constructs a new instance of ImportOptions3DM with default values of all properties.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public ImportOptions3DM()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ImportOptions3DM()
```

# See Also
ImportOptions3DM Class
ImportOptions3DM Overload
Autodesk.Revit.DB Namespace